app/controllers/admin/adminpanels_controller.rb

	def create
		@adminpanel = Adminpanel.create(frequency: params[:frequency], date: params[:date], time: params[:time])
---
INSERT INTO "adminpanels" ("frequency", "date", "time") VALUES (?, ?, ?)  [["frequency", "10"], ["date", "2015-05-12"], ["time", "2000-01-01 00:00:00"]]