app/views/dashboards/index.html.slim

SELECT  "dashboards".* FROM "dashboards" ORDER BY "dashboards"."update_date" ASC LIMIT ?  [["LIMIT", 1]]
---
				do
				= select_tag(:id, options_for_select(Dashboard.all.collect{|d| [d.update_date, d.id]}), {include_blank: true})