app/controllers/dashboards_controller.rb

SELECT  "dashboards".* FROM "dashboards" ORDER BY "dashboards"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
	def index
		@dashboards = Dashboard.all

SELECT  "dashboards".* FROM "dashboards" WHERE "dashboards"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def show
		@dashboard = Dashboard.find(params[:id])